{
  "allCoachesTips": [
    "Every great player started with a single juggle — consistency beats talent.",
    "Don’t rush. Smooth touches become fast touches later.",
    "If you drop it, that’s not failure — that’s the next rep.",
    "Improvement happens in centimeters, not miles.",
    "Focus on progress, not perfection.",
    "The ball should feel like a teammate, not a task.",
    "One quality session is better than ten sloppy ones.",
    "Treat every touch like a pass to yourself.",
    "Stay relaxed. Tension kills technique.",
    "Breathe — juggling is rhythm, not chaos.",
    "Train like someone watching your future highlight reel.",
    "Don’t compare your start to someone else’s middle.",
    "Make mistakes confidently.",
    "Be curious — every drop teaches you something.",
    "Winning is temporary; mastery is permanent.",
    "Set small goals, celebrate small wins.",
    "A champion’s mindset is built rep by rep.",
    "Your touch today is not your ceiling — it's your starting point.",
    "Pressure comes from rushing. Slow down and own your moments.",
    "If you’re frustrated, pause, reset, and start with one perfect touch.",
    "Keep your ankle locked — firm like a wall pass.",
    "Touch the bottom of the ball, not the side.",
    "Keep your toes up and your heel slightly down.",
    "Small touches beat big swings.",
    "Keep the ball between knee and waist height.",
    "Use both feet — even if it feels unnatural.",
    "Let the ball drop slightly before you touch it.",
    "Keep your standing foot light so you can adjust.",
    "Make every touch a pass to your future touch.",
    "Balance with your arms — don’t let them hang.",
    "Glance up every few touches to build awareness.",
    "Quiet touches show control — loud touches show panic.",
    "Plant your standing foot where you want the ball to land.",
    "Keep the ball centered — avoid drifting wide.",
    "Use your laces, not your toes.",
    "Find the middle ground between stiff and loose legs.",
    "Don’t chase the ball — shape your body early.",
    "Control the spin — clean touches lead to predictable movement.",
    "Start juggling from the ground, not your hands.",
    "Finish your session with 10 perfect touches — end with quality.",
    "Masters aren’t born — they’re built through repetition.",
    "Five minutes a day beats an hour once a week.",
    "When you improve your touch, you improve your whole game.",
    "Every juggle is an investment in your future self.",
    "This is where confidence begins.",
    "The ball rewards players who spend time with it.",
    "One more touch. One more rep. One more chance to grow.",
    "Champions train when it’s boring — that’s the separator.",
    "You don’t need a field — just a ball and a little space.",
    "When you get tired, focus on technique.",
    "Your first 100 touches today shape your game tomorrow.",
    "Your teammates can’t give you a better touch — only you can.",
    "You’re building a foundation others will notice.",
    "Your feet remember every rep, even the bad ones.",
    "How you train is how you play.",
    "Every drop is a reset button, not a setback.",
    "You’re closer to your breakthrough than you think.",
    "Touching the ball is never wasted time.",
    "You’re building control that will stay with you for life.",
    "Quitting is the only mistake that stops progress."
  ],
  "dailyChallenges": [
    "Hit your daily juggle goal.",
    "Get your longest streak of the week.",
    "Complete 3 sets of 20 clean touches.",
    "Use only your weaker foot for 30 seconds.",
    "Reach 50 total touches without using your hands.",
    "Keep every touch under waist height for 25 reps.",
    "Start from the ground and hit 10 juggles.",
    "Do 5 perfect toe taps, then juggle to 20.",
    "Alternate feet every touch for 20 reps.",
    "Start with a thigh pop-up and reach 15 juggles.",
    "10 left foot, 10 right foot, 10 alternating.",
    "Keep the ball inside a 1-meter circle while juggling.",
    "No-spin challenge: 15 clean touches.",
    "Train 3 times today: morning, afternoon, evening.",
    "Juggle while walking 5 steps forward and 5 steps back.",
    "Quiet touch challenge: silent touches only.",
    "Use thighs or shoulders only for 15 seconds.",
    "Slow touches → fast touches to improve control.",
    "Do 5 ground-starts, reaching at least 10 juggles each time.",
    "1 minute of non-stop juggling.",
    "Juggle to your age in touches.",
    "Beat yesterday’s total juggling time.",
    "Get 100 total touches today.",
    "Three attempts: beat your best score.",
    "Outside-only juggling for 10 touches.",
    "Keep the ball below your knee for 20 touches.",
    "Feet must stay inside a small circle while juggling.",
    "Try a new rhythm: 1-1-2 or 3-3-1 juggling pattern.",
    "Warm-up with 20 touches and cool-down with 20 more.",
    "Juggle in a new environment (hallway, backyard, garage)."
  ]
}
